Revit 2024 API
BuiltInFailures.LegendFailures.LegendComponentNotVisible Property
 The component you have selected is not visible in the selected view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId LegendComponentNotVisible { get; }
Visual Basic
Public Shared ReadOnly Property LegendComponentNotVisible As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ LegendComponentNotVisible {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.LegendFailures Class
Autodesk.Revit.DB Namespace